# Rebar Crank Type Utils Class

Source: https://www.revitapidocs.com/2026/0b779253-adc9-d628-0a3b-30d5897a74d1.htm

---

| Rebar Crank Type Utils Class |
| --- |

Utility class for dealing with Rebar Crank Type operations.
 To find all Rebar Crank Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST\_RebarCrankType. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Structure RebarCrankTypeUtils

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class RebarCrankTypeUtils
```

```
Public NotInheritable Class RebarCrankTypeUtils
```

```
public ref class RebarCrankTypeUtils abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarCrankTypeUtils = class end
```
The RebarCrankTypeUtils type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateRebarCrankType | Creates a Rebar Crank Type element. |
|  | GetAllRebarCrankTypes | Gets all the Rebar Crank Types elements from the document. |
|  | GetCrankLengthMultiplier | Gets the crank length multiplier value. |
|  | GetCrankOffsetMultiplier | Gets the crank offset multiplier value. |
|  | GetCrankRatio | Gets the crank ratio value. |
|  | SetCrankLengthMultiplier | Sets the crank length multiplier value. |
|  | SetCrankOffsetMultiplier | Sets the crank offset multiplier value. |
|  | SetCrankRatio | Sets the crank ratio value. |

Top See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace